lxf13927043839/Stm32_code/bluetooth/USER/main.c
			area_rotate();
			
			//data_buff[18]='1';
			//SENDstr_to_server((char *)data_buff);
			printf("\nkey2 test by interrupt\n");
		}		
		//清楚中断标志位，否则会一直进入中断函数
		EXTI_ClearITPendingBit(EXTI_Line7);
	}
	//key1
	
	if(RESET != EXTI_GetITStatus(EXTI_Line8))
	{
		delay_ms(10);	//去抖动
		if(key1==0)	 
		{	
			
			stop_rotate();
			
			//data_buff[18]='0';
			//SENDstr_to_server((char *)data_buff);
			printf("\nkey1 test by interrupt\n");
		}		
		//清楚中断标志位，否则会一直进入中断函数
		EXTI_ClearITPendingBit(EXTI_Line8);
	}
	
}

//-----------电机控制初始化---------

#define ENA PBout(10)	
#define IN1 PBout(11)	// D1	 
#define IN2 PCout(6)	// D1	 
void ELECTRI_motor_init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	//开启GPIO时钟
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB,ENABLE);
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC,ENABLE);
	//初始化IO

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11; //GPIOB11  GPIOB10
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;//输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; //速度50MHz
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; //推挽复用输出
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP; //上拉
	GPIO_Init(GPIOB,&GPIO_InitStructure); //PB10, PB11
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6; //GPIOC6
	GPIO_Init(GPIOC,&GPIO_InitStructure); //PC6
	
	GPIO_ResetBits(GPIOC,GPIO_Pin_6);
	GPIO_ResetBits(GPIOB,GPIO_Pin_10 | GPIO_Pin_11);
}

void front_rotate(void)
{
	ENA=1;
	IN1=1;
	IN2=0;
}
void area_rotate(void)
{
	ENA=1;
	IN1=0;
	IN2=1;
}
void stop_rotate(void)
{
	ENA=1;
	IN1=0;
	IN2=0;
}

//初始化dht11 光敏、RTC
void ALL_SENSOR_init(void)
{
	//****************************************//
  //如果没有dht11 灯会闪烁
	while(DHT11_init())
	{
		LED1=!LED1;
	}
	//光敏
	ADC_init();      
	//RTC
	My_RTC_init();
	//在这里设置选择了ck_spre的时钟频率，即1HZ的频率
	//所有给0 会产生1S
	//可看寄存器的配置,10x是选择了ck_spre的时钟频率
	RTC_Set_WakeUp(RTC_WakeUpClock_CK_SPRE_16bits,0);//WAKE UP
	
	ELECTRI_motor_init();
	
	People_init();
	

	
}
//获取dht11 光敏、RTC数据
void get_sensor_data(char *data_buff)
{
	u8 temperature;//温度
  u8 humidity;   //湿度
	u16 adcx=0;			 //adc读取值
	float light_streng=0;
	RTC_TimeTypeDef RTC_TimeStruct;//时间
	RTC_DateTypeDef RTC_DateStruct;//日期
	u8 rtc_buf[40];
	
	RTC_GetDate(RTC_Format_BIN, &RTC_DateStruct);
	sprintf((char*)rtc_buf,"Date:20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,
	RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
	//printf("%s\n",rtc_buf);

	
	sprintf((char*)rtc_buf,"Week:%d",RTC_DateStruct.RTC_WeekDay);
	//printf("%s\n",rtc_buf);
	
	
	RTC_GetTime(RTC_Format_BIN,&RTC_TimeStruct);
	sprintf((char*)rtc_buf,"Time:%02d:%02d:%02d",RTC_TimeStruct.RTC_Hours,
	RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
	//printf("%s\n",rtc_buf);
	
	adcx=Get_Adc_Average(ADC_Channel_9,20);//获取通道9的转换值，20次取平均
	light_streng=(float)adcx*(3.3/4096);          //获取计算后的带小数的实际电压值，比如3.1111
	//printf("光敏:light_streng = %f\n",light_streng);
	
	DHT11_Read_Data(&temperature,&humidity);
	//printf("温度temperature = %d \n",temperature);
	//printf("湿度humidity    = %d \n",humidity);
	
	data_buff[1]=(temperature/10)+48;
	data_buff[2]=(temperature%10)+48;
	
	data_buff[4]=(humidity/10)+48;
	data_buff[5]=(humidity%10)+48;
	
	data_buff[7]=((int)(light_streng*10)/10)+48;
	data_buff[9]=((int)(light_streng*10)%10)+48;
	
	printf("所采集的数据data = %s \n",data_buff);
}

 /*------------------------------------------------------------------- 
	1、汉字大小：24*24共 72字节
  2、显示汉字时调用对应序号：
	温(0) 湿(1) 度(2) 光(3) 照(4) 强(5) 度(6) 窗(7) 帘(8) 状(9) 态(10) 智(11) 能(12) 手(13) 动(14) 模(15)
       式(16) 阈（17） 值（18） 摄氏度（19） 百分号（20） 弱（21） 中（22） 强（23） 开（24） 关（25）
 */
int chinese[]={0,2,-1};//温度
int chinese1[]={1,2,-1};//湿度
int chinese2[]={3,4,5,6,-1};//光照强度
int chinese3[]={3,4,17,18,-1};//光照阈值

void LCD_show_RTC(void);
void LCD_showdate(void)
{
	int x=0,y=0;
	u8 temp[2];
	RTC_DateTypeDef RTC_DateStruct;
	u8 temp_buff[40]; 
	
	
	BRUSH_COLOR=RED;      //设置画笔颜色为黑色
	//温度
	x=95,y=47;
	temp[0]=data_buff[1];
	temp[1]=data_buff[2];
	LCD_DisplayString(x,y,24,temp); //显示一个24字体字符串，宽只占了12,字符显示时候
	LCD_DisplayChinese_one(x+12*2,y,19,24);
	
	//湿度
	x=95;y=80;
	temp[0]=data_buff[4];
	temp[1]=data_buff[5];
	LCD_DisplayString(x,y,24,temp); //显示一个12/16/24字体字符串
	LCD_DisplayChinese_one(x+12*2,y,20,24);
	
	//光照强度----采用弱、中、强来表示，数字意义不大
	x=95;y=113;
	temp[0]=data_buff[7];
	temp[1]=data_buff[9];
	LCD_DisplayString(x,y,24,temp); //显示一个12/16/24字体字符串
	
	//显示日期
	x=5;y=295;
	RTC_GetDate(RTC_Format_BIN, &RTC_DateStruct);
	sprintf((char*)temp_buff,"20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
	//printf("%s\n",temp_buff);
	LCD_DisplayString(x,y,24,temp_buff); //显示一个12/16/24字体字符串
	
	//显示时间测试位置,显示ok---该函数放在秒的唤醒服务函数
	//LCD_show_RTC();
	
	/*	
	//在这里设置选择了ck_spre的时钟频率，即1HZ的频率
	//所有给0 会产生1S
	//可看寄存器的配置,10x是选择了ck_spre的时钟频率
	RTC_Set_WakeUp(RTC_WakeUpClock_CK_SPRE_16bits,0);//WAKE UP 


	
	
	//显示星期
	y=24*4;
	sprintf((char*)temp_buff,"Week:%s",Weekday[RTC_DateStruct.RTC_WeekDay-1]);
	//printf("%s\n",temp_buff);
	LCD_DisplayString(x,y,24,temp_buff); //显示一个12/16/24字体字符串

	//显示光照阈值
	y=24*6;
	LCD_DisplayChinese_string(x,y,24,chinese3);
	LCD_DisplayChar(x+24*4,y,':',24);//宽度只有8
	LCD_DisplayChinese_one(x+24*5,y,23,24);
	*/
}
void LCD_show_RTC(void)
{
	int x=0,y=0;
	RTC_TimeTypeDef RTC_TimeStruct;
	u8 temp_buff[40]; 

	//显示时间
	x=142;y=295;
	RTC_GetTime(RTC_Format_BIN,&RTC_TimeStruct);
	sprintf((char*)temp_buff,"%02d:%02d:%02d",RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
	//printf("%s\n",temp_buff);
	LCD_DisplayString(x,y,24,temp_buff); //显示一个12/16/24字体字符串
}

//跳转到设置光照阈值的界面
HEADCOLOR *imginfo;//显示图片的时候都可以用到

extern const u8 gImage_smart_on[];//智能模式，蜂鸣器开
extern const u8 gImage_smart_off[];//智能模式，蜂鸣器关
char smart_change_flag=1;

extern const u8 gImage_on_on[]; //蜂鸣器开，窗帘开
extern const u8 gImage_on_off[];//蜂鸣器开，窗帘关
extern const u8 gImage_off_on[];//蜂鸣器关，窗帘开
extern const u8	gImage_off_off[];//蜂鸣器关，窗帘关

extern const u8 gImage_set_light[];//设置光照阈值界面
extern const u8 gImage_set_time[]; //设置定时


/*
   功能：对光照阈值进行设置，并写入到at24c02中
*/
void SET_lightcondition(void)
{
	//1、显示图片
	u8 choose=0;
	u8 buff;
	imginfo=(HEADCOLOR*)gImage_set_light;
	image_display(0,0,(u8*)gImage_set_light);
	Xdown=-1;
	Ydown=-1;
	
	AT24CXX_Read(1,(u8 *)&buff,1);
	if(buff==1)
	{
		LCD_DisplayChinese_one(105,45,21,24);
	}
	else if(buff==2)
	{
		LCD_DisplayChinese_one(105,45,22,24);
	}
	else if(buff==3)
	{
		
		LCD_DisplayChinese_one(105,45,23,24);
	}
	
	while(1)
	{
		XPT2046_Scan(0);
		//弱
		if(Xdown>20&&Xdown<80&&Ydown>85&&Ydown<125)
		{
			delay_ms(300);
			LCD_DisplayChinese_one(105,45,21,24);
			choose=1;
		}
		//中
		if(Xdown>85&&Xdown<145&&Ydown>85&&Ydown<125)
		{
			delay_ms(300);
			LCD_DisplayChinese_one(105,45,22,24);
			choose=2;
		}
		//强
		if(Xdown>150&&Xdown<210&&Ydown>85&&Ydown<125)
		{
			delay_ms(300);
			LCD_DisplayChinese_one(105,45,23,24);
			choose=3;
		}
		//确认-----------之后返回至主界面
		if(Xdown>97&&Xdown<147&&Ydown>134&&Ydown<187)
		{
			delay_ms(200);
			
			AT24CXX_WriteOneByte(1,choose);
			printf("light successful\n");
			
			//delay_ms(100);
			//AT24CXX_Read(1,(u8 *)&buff,1);
			//printf("choose = %d\n",choose);
			
			//add 
			imginfo=(HEADCOLOR*)gImage_smart_on;
			image_display(0,0,(u8*)gImage_smart_on);
			break;
			
