lxf13927043839/Stm32_code/bluetooth/USER/main.c
		}
		
		//返回按钮--------返回至主界面
		if(Xdown>0&&Xdown<36&&Ydown>0&&Ydown<38)
		{
			printf("(x,y)=(%d,%d)\n",Xdown,Ydown);
			delay_ms(300);
			
			//这里要到后边还要继续有一个判断，看显示的是哪一张图
			//add 
			imginfo=(HEADCOLOR*)gImage_smart_on;
			image_display(0,0,(u8*)gImage_smart_on);
			break;
		}
	}
}	

/*
	功能：定时窗帘的开或者关---注意：把提示换成中文的

*/
/*

* 说    明：长按按KEY3进行时间调整，按KEY0进行数值的加1，按KEY1数值进行减1，  
            按KEY2右移选择要设置的选项，在调整完后短按KEY3，确认调整时间         
*********************************************************************************/

//u8 const *weekdate[7]={"Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"};
u8 const *set_option[7]={"Year","Month","Day","Hours","Minutes","Seconds"," "};

void Time_Display()//把变化的时间写入
{
 LCD_DisplayString(30,220,24,"Date:20  -  -  ");
 LCD_DisplayNum(114,220,RTC_DateStruct.RTC_Year,2,24,1);
 LCD_DisplayNum(150,220,RTC_DateStruct.RTC_Month,2,24,1);
 LCD_DisplayNum(186,220,RTC_DateStruct.RTC_Date,2,24,1);
 LCD_DisplayString(30,250,24,"Time:  :  :  ");
 LCD_DisplayNum(90,250,RTC_TimeStruct.RTC_Hours,2,24,1);	
 LCD_DisplayNum(126,250,RTC_TimeStruct.RTC_Minutes,2,24,1);
 LCD_DisplayNum(162,250,RTC_TimeStruct.RTC_Seconds,2,24,1);
 //LCD_DisplayString(30,260,16,"Week:        ");
 //LCD_DisplayString(70,260,16,(u8 *)weekdate[RTC_DateStruct.RTC_WeekDay-1]);
}
void Time_has_set()//显示定时的时间
{
 LCD_DisplayString(70,57,24,"20  -  -  ");
 LCD_DisplayNum(94,57,RTC_DateStruct.RTC_Year,2,24,1);
 LCD_DisplayNum(130,57,RTC_DateStruct.RTC_Month,2,24,1);
 LCD_DisplayNum(166,57,RTC_DateStruct.RTC_Date,2,24,1);
 LCD_DisplayString(70,81,24,"  :  :  ");
 LCD_DisplayNum(70,81,RTC_TimeStruct.RTC_Hours,2,24,1);	
 LCD_DisplayNum(106,81,RTC_TimeStruct.RTC_Minutes,2,24,1);
 LCD_DisplayNum(142,81,RTC_TimeStruct.RTC_Seconds,2,24,1);
}


void ADJUST_time(u8 option,u8 shanshuo)
{
		if(shanshuo%50==0)  //提示现在要设置的选项
		{
		  LCD_DisplayString_color(30,280,24,"Please Set          ",BLUE,WHITE);
		  LCD_DisplayString_color(162,280,24,(u8 *)set_option[option],BLUE,WHITE);
		}
		
		//设置时数值的加减1
		if( (keydown_data==KEY0_DATA)||(keydown_data==KEY1_DATA))
		{
		  if(keydown_data==KEY0_DATA)
			{
			  switch(option)
				{
				  case 0: RTC_DateStruct.RTC_Year+=1;   break;
					case 1: RTC_DateStruct.RTC_Month+=1;  break;
					case 2: RTC_DateStruct.RTC_Date+=1;   break;
					case 3: RTC_TimeStruct.RTC_Hours+=1;  break;
					case 4: RTC_TimeStruct.RTC_Minutes+=1;break;
					case 5: RTC_TimeStruct.RTC_Seconds+=1;break;
				}	
			}
			if(keydown_data==KEY1_DATA)
			{
			  switch(option)
				{
				  case 0: RTC_DateStruct.RTC_Year-=1;   break;
					case 1: RTC_DateStruct.RTC_Month-=1;  break;
					case 2: RTC_DateStruct.RTC_Date-=1;   break;
					case 3: RTC_TimeStruct.RTC_Hours-=1;  break;
					case 4: RTC_TimeStruct.RTC_Minutes-=1;break;
					case 5: RTC_TimeStruct.RTC_Seconds-=1;break;
				}	
			}
		}
		//闪烁显示：显示
	if(shanshuo==150)
	{
			Time_Display();
//			LCD_DisplayNum(86,220,RTC_DateStruct.RTC_Year,2,16,1);
//			LCD_DisplayNum(110,220,RTC_DateStruct.RTC_Month,2,16,1);
//			LCD_DisplayNum(134,220,RTC_DateStruct.RTC_Date,2,16,1);
//			LCD_DisplayNum(70,240,RTC_TimeStruct.RTC_Hours,2,16,1);
//			LCD_DisplayNum(94,240,RTC_TimeStruct.RTC_Minutes,2,16,1);
//			LCD_DisplayNum(118,240,RTC_TimeStruct.RTC_Seconds,2,16,1);
	}	
		//闪烁显示：不显示
	switch(option)
	{  
		case 0: {  if(shanshuo==49)  LCD_DisplayString(114,220,24,"  ");	 break;  }
		case 1: {  if(shanshuo==49)  LCD_DisplayString(150,220,24,"  "); break;  }
		case 2: {  if(shanshuo==49)  LCD_DisplayString(186,220,24,"  "); break;  }
		case 3: {  if(shanshuo==49)  LCD_DisplayString(90,250,24,"  ");  break;  }
		case 4: {  if(shanshuo==49)	 LCD_DisplayString(126,250,24,"  ");	 break;	 }
		case 5: {  if(shanshuo==49)	 LCD_DisplayString(162,250,24,"  "); break;  }		
	}
}	


void SET_time(void)
{
	//注：有一些函数是初始化过了的，整合时候要删除
	
	u8 process=0;  //程序流程走向
	u8 option=6;     //调整时间选项
	u8 t=0,j;      //计时参数
	u8 time_set_flag=0;//是否设置了按键的定时标志
	u8 now_date_buff[40];//当前的日期
	u8 now_time_buff[40];//当前的时间

	u8 time_buff[40];//存放定时的时间
	u8 date_buff[40];//存放定时的日期
	u8 test[40];//从24c02 读取数据测试
	u8 curtain_status=3;//窗帘状态,只有0/1 状态是有效的，其他数字是无效的
	short set_tim_success=-1; //时间的设置是正常的 
	u8 had_settimeflag=3; //检测是否有设置了
	u8 temp;
	/*
	char temp[]="20200215";
	char temp1[]="20200315";
	
	ret=Judge_correct_time(temp1,temp);
	printf("ret = %d\n",ret);
	*/ 
	
	/*
	//NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);//设置系统中断优先级分组2
	//Systick_init(168);         //初始化延时函数
	//UART1_init(115200);
	
	//LED_init();					  //初始化LED
 	//LCD_init();					  //初始化LCD
	//KEY_init();           //初始化KEY
  */
	BRUSH_COLOR=RED;
	
	//待删除部分
	/*
	LCD_DisplayString(10,10,24,"Illuminati STM32F4");	
	LCD_DisplayString(10,40,16,"Author:Clever");
	LCD_DisplayString(30,70,24,"14.RTC TEST");
	LCD_DisplayString(30,100,16,"KEY3 Long :Adjust time");
	LCD_DisplayString(30,120,16,"     Short:Adjust OK");
	LCD_DisplayString(30,140,16,"KEY0: V++  KEY1: V--");
	LCD_DisplayString(30,160,16,"KEY2: Right Move");
	*/
	RTC_GetTimes(RTC_Format_BIN);//获得系统的时间
	Time_Display(); //在底下进行的动态显示
	

	//显示界面
	imginfo=(HEADCOLOR*)gImage_set_time;
	image_display(0,0,(u8*)gImage_set_time);
	
	//判断之前是否有设置了定时
	AT24CXX_Read(4,&had_settimeflag,1);
	if(had_settimeflag==1||had_settimeflag==0)
	{
		//printf("正在画图\n");
		
		AT24CXX_Read(5,(u8 *)date_buff,10);
		delay_ms(50);
		AT24CXX_Read(15,(u8 *)time_buff,8);
		
		LCD_DisplayString_color(70,57,24,date_buff,BLUE,WHITE);
		LCD_DisplayString_color(70,81,24,time_buff,BLUE,WHITE);
		
		if(had_settimeflag==0)
		{
			LCD_DisplayChinese_one(110,108,25,24);
		}else if(had_settimeflag==1)
		{
			LCD_DisplayChinese_one(110,108,24,24);
		}
	}
	
  while(1) 
	{		
		key_scan_advanced(0);	
		t++;
		//add
		XPT2046_Scan(0);
		
		//返回
		if(Xdown>0&&Xdown<36&&Ydown>0&&Ydown<38)
		{
			delay_ms(200);
			printf("break successful\n");
			break;
			
		}
		//开
		if(Xdown>30&&Xdown<86&&Ydown>145&&Ydown<183)
		{
			delay_ms(200);
			LCD_DisplayChinese_one(110,108,24,24);
			curtain_status=1;
		}
		//关
		if(Xdown>154&&Xdown<210&&Ydown>145&&Ydown<183)
		{
			delay_ms(200);
			LCD_DisplayChinese_one(110,108,25,24);
			curtain_status=0;
		}
		//关闭/取消定时
		if(Xdown>197&&Xdown<240&&Ydown>0&&Ydown<43)
		{
			delay_ms(200);
			
			image_display(0,0,(u8*)gImage_set_time);
			process=0;
			curtain_status=3;
			//在添加上把at24c02里边的值清理干净
			
			AT24CXX_Write(4,(u8*)&curtain_status,1);
			

