lxf13927043839/Stm32_code/bluetooth/USER/main.c
		}
		
		
		switch(process)
		{
			case 0:   // 流程0：时钟显示
			     {
						 if(key_tem==4&&key_time>250)//长按1.25秒，按键释放时，key_time自动设置0，见key.c
							{
								process=1;   //长按KEY3 进入调整时间流程
								break;
							}
						 if( ((t%50)==0) && (time_set_flag==0) )	//每250ms更新显示,并且没有定时
							{
								RTC_GetTimes(RTC_Format_BIN);//获取系统时间
								Time_Display();
							} 
						break;
			     }
			case 1:    // 流程1：调整时间
					{
					 if(keydown_data==KEY2_DATA) //按KEY2选项右移
					 {
							 option++;
							 if(option>5)   //循环
								 option=0;
					 }
					 					 
					 ADJUST_time(option,t);//调整时间函数
					 if(keydown_data==KEY3_DATA)
					 {
						 //Time_Display();// 防止在闪烁不显示的时候，短按KEY3确认调整后 显示空
						 //RTC_SetTimes(RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date,RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
						 //RTC_GetTimes(RTC_Format_BIN);
						 //Time_Display();
						 

						 Time_has_set();//先显示用户设置的时间，在判断其合理性
						 
						 //存放设置的时间日期
						 sprintf((char*)date_buff,"20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
						 //printf("%s  length = %d\n",date_buff,strlen(date_buff));
						 sprintf((char*)time_buff,"%02d:%02d:%02d",RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
						 //printf("%s  length = %d\n",time_buff,strlen(time_buff));
						
						//获取当前的时间日期,更改了时间
						 RTC_GetTimes(RTC_Format_BIN);
						 
						 sprintf((char*)now_date_buff,"20%02d-%02d-%02d",RTC_DateStruct.RTC_Year,RTC_DateStruct.RTC_Month,RTC_DateStruct.RTC_Date);
						 //printf("%s  length = %d\n",now_date_buff,strlen(now_date_buff));
						 sprintf((char*)now_time_buff,"%02d:%02d:%02d",RTC_TimeStruct.RTC_Hours,RTC_TimeStruct.RTC_Minutes,RTC_TimeStruct.RTC_Seconds);
						 //printf("%s  length = %d\n",now_time_buff,strlen(now_time_buff));
						 
						 
						 if(strcmp(date_buff,now_date_buff)>0)
						 {
								//printf("set date ok\n");	
								set_tim_success=1;
						 }
						 else if(strcmp(date_buff,now_date_buff)==0)
						 {
								if(strcmp(time_buff,now_time_buff)>0)
								{
									//printf("set time ok\n");
									set_tim_success=1;
								}
								else
								{
									//printf("set time no\n");
									LCD_DisplayString_color(30,280,24,"Please Reset time",BLUE,WHITE);
									for(j=0;j<200;j++) delay_ms(10);
								}
						 }
						 else
						 {
								//printf("set date no\n");
								LCD_DisplayString_color(30,280,24,"Please Reset date",BLUE,WHITE);
							  for(j=0;j<200;j++) delay_ms(10);
						 }
						 
						 //设置的定时没有问题，再确认有选择窗帘开关，写入at24c02，时间比窗帘的开关更有必要
						 if(set_tim_success==1)
						 {
							 if(curtain_status!=3)
							 {
									printf("set and choose ok，curtain_status= %d \n",curtain_status);
									LCD_DisplayString_color(30,280,24,"Adjust TIM OK          ",BLUE,WHITE);
									//for(j=0;j<100;j++) delay_ms(10);  // Adjust OK 调整OK显示1秒
									//LCD_DisplayString(30,280,24,"                        ");
									
								 /*
										定时ok，窗帘选择ok，接下来就要写进入到at24c02中
										例子：
								  //AT24CXX_Write(0,(u8*)date_buff,strlen(date_buff));
									//AT24CXX_Read(0,test,strlen(date_buff));
									//printf("test = %s\n",test);
								 */
									AT24CXX_Write(4,(u8*)&curtain_status,1);
									//delay_ms(100);
								  //AT24CXX_Read(4,&temp,1);
									//printf("temp = %d \n",temp);
									
									AT24CXX_Write(5,(u8*)date_buff,strlen(date_buff));
									delay_ms(50);
									AT24CXX_Write(15,(u8*)time_buff,strlen(time_buff));
									//delay_ms(50);
									
									//AT24CXX_Read(5,test,strlen(date_buff)+strlen(time_buff));
									
									//printf("test = %s\n",test);
									
								  option=0;    //选项从头来
									process=0;   //短按KEY3时间设置完成 返回到时间显示
									break;
								 
							 }
							 else
							 {
									LCD_DisplayString_color(0,280,24,"Please choose on/off",BLUE,WHITE);
									for(j=0;j<200;j++) delay_ms(10);
									image_display(0,0,(u8*)gImage_set_time);
							 }
						 }

						 
					 }
					break;
			   }
	  }
		delay_ms(5); //系统延时，也算是系统计时
	}	
}
int main()
{
	int only_test=0;
	int people=0;
	int i=0,cycle=0,T=2048;
	//test
	
	imginfo=(HEADCOLOR*)gImage_smart_on;
	
	Systick_init(168);  //初始化延时函数，没有初始化会导致程序卡死
	
	BEEP_init();
	LED_init();
  KEY_init();
	EXTI_init( );
	
	UART1_init(115200);
	printf("reset ----\n");
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
	
	AT24CXX_init(); 
	while(AT24CXX_Check())
	{
		printf("AT24CXX 检测失败\n");
  	LED0=!LED0;
	}
	
	
	//TIM3_init(5*10000-1,8400-1);//定时器5秒检测开看门狗
	//ESP8266_UART4_init(115200);
	//WIFI_Server_Init();
	
	//ALL_SENSOR_init();
	LCD_init();  //初始化LCD FSMC接口和显示驱动

	
	Touch_Init();				//触摸屏的初始化
	
	printf("start \n");
	
	My_RTC_init();
	//在这里设置选择了ck_spre的时钟频率，即1HZ的频率
	//所有给0 会产生1S
	//可看寄存器的配置,10x是选择了ck_spre的时钟频率
	RTC_Set_WakeUp(RTC_WakeUpClock_CK_SPRE_16bits,0);//WAKE UP 
	
	//R_Touch_test(); //函数中间有一个循环检测触摸屏
	image_display(0,0,(u8*)gImage_smart_on);
	LCD_showdate();
	
	
	while(1)
	{
		XPT2046_Scan(0);//长按有反应，待解决 		 
		/*
		if(Xdown>0&&Xdown<45&&Ydown>255&&Ydown<300)
		{
			printf("(x,y)=(%d,%d)\n",Xdown,Ydown);
			if(smart_change_flag==1)
			{
				imginfo=(HEADCOLOR*)gImage_smart_off;
				image_display(0,0,(u8*)gImage_smart_off);
				smart_change_flag=0;
			}
			else if(smart_change_flag==0)
			{
				imginfo=(HEADCOLOR*)gImage_smart_on;
				image_display(0,0,(u8*)gImage_smart_on);
				smart_change_flag=1;
			}
			delay_ms(200);
		}
		*/
		//设置光照阈值
		if(Xdown>164&&Xdown<204&&Ydown>140&&Ydown<180)
		{
			printf("(x,y)=(%d,%d)\n",Xdown,Ydown);
			delay_ms(300);
			SET_lightcondition();
		}
		//到时要模式来选择，先分智能与手动
		
		//设置定时开关
		if(Xdown>190&&Xdown<230&&Ydown>226&&Ydown<266)
		{
			delay_ms(300);
			SET_time();
		}
		
		//夜晚蜂鸣器
		if(Xdown>0&&Xdown<45&&Ydown>255&&Ydown<300)
		{
			delay_ms(200);
			
			
		}
		
	}

}
